Ran Plan for dir: `projects/dev` workspace: `default`

<details><summary>Show Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
~ update in-place

Terraform will perform the following actions:

  # module.argocd-application.argocd_application.fetch-system-streams will be created
+ resource "argocd_application" "fetch-system-streams" {
      + cascade  = true
      + id       = (known after apply)
      + status   = (known after apply)
      + validate = true
      + wait     = true

      + metadata {
          + generation       = (known after apply)
          + name             = "fetch-system-streams"
          + namespace        = "argocd"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + project                = "default"
          + revision_history_limit = 10

          + destination {
                name      = null
              + namespace = "fetch-system"
              + server    = "https://kubernetes.default.svc"
            }

          + source {
              + path            = "fetch-system.streams/kustomize/overlays/dev"
              + repo_url        = "https://github.com/goboolean/manifests"
              + target_revision = "main"
            }

          + sync_policy {
              + sync_options = [
                  + "StatusForceHealth=true",
                ]

              + automated {
                  + allow_empty = true
                  + prune       = true
                  + self_heal   = true
                }
            }
        }
    }

  # module.argocd-application.argocd_application.fetch-system-worker will be created
+ resource "argocd_application" "fetch-system-worker" {
      + cascade  = true
      + id       = (known after apply)
      + status   = (known after apply)
      + validate = true
      + wait     = true

      + metadata {
          + generation       = (known after apply)
          + name             = "fetch-system-worker"
          + namespace        = "argocd"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + project                = "default"
          + revision_history_limit = 10

          + destination {
                name      = null
              + namespace = "fetch-system"
              + server    = "https://kubernetes.default.svc"
            }

          + source {
              + path            = "fetch-system.worker/kustomize/overlays/dev"
              + repo_url        = "https://github.com/goboolean/manifests"
              + target_revision = "main"
            }

          + sync_policy {
              + sync_options = [
                  + "StatusForceHealth=true",
                ]

              + automated {
                  + allow_empty = true
                  + prune       = true
                  + self_heal   = true
                }
            }
        }
    }

  # module.gce.google_compute_instance.default will be updated in-place
~ resource "google_compute_instance" "default" {
        id                        = "projects/goboolean-448812/zones/asia-northeast3-a/instances/atlantis"
      ~ metadata                  = {
          - "ssh-keys" = <<-EOT
                jipark7937:ecdsa-sha2-nistp256 AAAAE2VjZHNhLXNoYTItbmlzdHAyNTYAAAAIbmlzdHAyNTYAAABBBAL6pQeHeophymNSxtHXJY2oqyLp6fBvHEMFSEtSUS5vq+qVlZSfAniUrpqeUefB0Z0wZHAX+HqPDL0OTFDhKmM= google-ssh {"userName":"jipark7937@gmail.com","expireOn":"2025-02-03T13:12:39+0000"}
                jipark7937:ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAFb+GyCqCbg5+YQPod6E4pXX7Zd133W3IRiNrP+jcrT4zYS55KOdwg4iuD/qStoLZYYNu+MlkrmarshRmjHNTEm4Ldtwlz/8TqbKTH2D1EVpGEo28ir0sZgRIYr2Bh3KfKZuqcGNXdDU38R0r8WmwzV4aTWdX3Jx1qnyoWNuwYj9hHbjldJKmmFEtf/f3OLThxs7iKoeY9ro4WlzTrGxwcHF4jd+wOZzUkn0yzdGR5gDEOVZ9VhaS+1ZY+3E6SiQ5RZQFVO0JsByoTUQxR7EwiEu3o9i6HE6Kb85PeG27kNBIkfM/wEEATcgG3kRdfJu6uKNafEIF1ybFATMhdMLpnU= google-ssh {"userName":"jipark7937@gmail.com","expireOn":"2025-02-03T13:12:43+0000"}
                goboolean241225:ecdsa-sha2-nistp256 AAAAE2VjZHNhLXNoYTItbmlzdHAyNTYAAAAIbmlzdHAyNTYAAABBBC0R5aBM9zLfag5ZngzuzENRHjrg/PsYYCXlgsnI7eRJSf1fRJqe9AQx/JXXKHMF3AkjxOln+vJlnjsV5BW7+oI= google-ssh {"userName":"goboolean241225@gmail.com","expireOn":"2025-02-03T13:13:32+0000"}
                goboolean241225:ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAFV/hEPac7yTl1Xcr5uPwOfUYhI8rYBvu2rGOVpaRC89GauQeuPHoTY/vbg5g10bJ0q5xZ28ofzyMHg9nRYz+eJ1C6rBmKIU0M/kC2fVN1vG1dbIkxxdUa372CIYMkV4RU2TxyaBjdPVCOUxgKpf87HmRcXHQfpu0U+5IuVuZ/yjnVBe5dpsSUJgWaphfc47kdE/sbnmgkxD67uCNW4ujusuWdMbk0Knr3GwLYzJ6g/jKqaGGk0lmPPDiE+pkrTp4buQd50jj4qdq301GKFDYR8MicmeHQ4bXNpjCeI5OSkkPOTcOVlIUd+i0LfUpdVpo04eqSGJqCn6MBhHZxN160s= google-ssh {"userName":"goboolean241225@gmail.com","expireOn":"2025-02-03T13:13:36+0000"}
            EOT -> null
        }
        name                      = "atlantis"
        tags                      = [
            "atlantis-server",
        ]
        # (20 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

Plan: 2 to add, 1 to change, 0 to destroy.


```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d projects/dev`
* :put_litter_in_its_place: To **delete** this plan click [here](http://34.64.35.124/lock?id=goboolean%252Finfrastructure%252Fprojects%252Fdev%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d projects/dev`
</details>
Plan: 2 to add, 1 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
